###题目
##自行给定 int 型变量 a、b、c、d 的初值，设计程序依次计算并输出下列表达式：
##x1 = a + (b = 2 * c)  d
##x2 = (a += b) - (c -= d)
##x3 = d *= a + c
##x4 = a /= 2 + b % 3
##x5 = double(a + b + c + d) / 4
##要求在每一步计算后，都立即输出 x1~x5 中当前表达式的值，以及 a、b、c、d 的新值。
##要求：
##1）初值不能过于特殊，建议设置为彼此不同的整数；
##2）程序输出应清楚区分“表达式结果”和“变量更新后的值”；
##3）实验报告中分析：哪些表达式主要体现“赋值副作用”，哪些表达式只体现“计算结果”。

##参考答案：
#include <iostream>
using namespace std;
int main() {

    int a = 5, b = 3, c = 4, d = 7;

    cout << "初始值: a= ," << a << " b= ," << b << " c= ," << c << " d= ," << d << endl;
    cout << "-----------------------------------" << endl;

    double x1 = a + (b = 2 * c) - d;
    cout << "x1 = a + (b = 2*c) - d = " << x1 << endl;
    cout << "  更新后: a=" << a << " b=" << b << " c=" << c << " d=" << d << endl;
    cout << "-----------------------------------" << endl;

    double x2 = (a += b) - (c -= d);
    cout << "x2 = (a+=b) - (c-=d) = " << x2 << endl;
    cout << "  更新后: a=" << a << " b=" << b << " c=" << c << " d=" << d << endl;
    cout << "-----------------------------------" << endl;

    double x3 = d *= a + c;
    cout << "x3 = d *= a+c = " << x3 << endl;
    cout << "  更新后: a=" << a << " b=" << b << " c=" << c << " d=" << d << endl;
    cout << "-----------------------------------" << endl;

    double x4 = a /= 2 + b % 3;
    cout << "x4 = a /= 2 + b%3 = " << x4 << endl;
    cout << "  更新后: a=" << a << " b=" << b << " c=" << c << " d=" << d << endl;
    cout << "-----------------------------------" << endl;

    double x5 = double(a + b + c + d) / 4;
    cout << "x5 = double(a+b+c+d)/4 = " << x5 << endl;
    cout << "  更新后: a=" << a << " b=" << b << " c=" << c << " d=" << d << endl;
    cout << "-----------------------------------" << endl;

    return 0;
}
